Revit 2026 API

# FilterStringRuleRuleString Property

---

The user-supplied string against which strings from a Revit document will be tested.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string RuleString { get; set; }
```
```vb
Public Property RuleString As String
	Get
	Set
```
```cpp
public:
property String^ RuleString {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member RuleString : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

FilterStringRule Class

Autodesk.Revit.DB Namespace